app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

UPDATE "movies" SET "rating" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "PG"], ["description", ""], ["updated_at", "2025-11-10 22:34:42.544308"], ["id", 2]]
---
  def update
    if @movie.update(movie_params)